In [2]:
import pandas as pd
import numpy as np

In [4]:
string_data=pd.Series(['aardasd','arkcsada',np.nan,'avocado'])
string_data

0     aardasd
1    arkcsada
2         NaN
3     avocado
dtype: object

In [10]:
string_data.isnull(),string_data.isna()

(0    False
 1    False
 2     True
 3    False
 dtype: bool,
 0    False
 1    False
 2     True
 3    False
 dtype: bool)

In [15]:
string_data[0]=None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [17]:
string_data.notnull(),string_data.notna()

(0    False
 1     True
 2    False
 3     True
 dtype: bool,
 0    False
 1     True
 2    False
 3     True
 dtype: bool)

In [20]:
string_data=string_data.dropna()

In [21]:
string_data

1    arkcsada
3     avocado
dtype: object

In [23]:
from numpy import nan as NA
data=pd.Series([1,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [27]:
data.dropna(inplace=True)

In [28]:
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [29]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
        [NA, NA, NA], [NA, 6.5, 3.]])

In [33]:
cleaned=data.dropna()

In [34]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [36]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.668976  0.737992  1.451797
1 -0.225695  0.349492 -0.073608
2  1.824398 -0.253469 -1.332313
3  1.416881  0.219519  0.138909
4  1.800326  1.338266 -1.469026
5 -0.387412 -1.072996 -1.583961
6 -1.606118  0.307178  1.813142

In [41]:
df.iloc[:4,1:]=NA

In [42]:
df

          0         1         2
0  0.668976       NaN       NaN
1 -0.225695       NaN       NaN
2  1.824398       NaN       NaN
3  1.416881       NaN       NaN
4  1.800326  1.338266 -1.469026
5 -0.387412 -1.072996 -1.583961
6 -1.606118  0.307178  1.813142

In [43]:
df.fillna(np.mean(df))

          0         1         2
0  0.668976  0.190816 -0.413282
1 -0.225695  0.190816 -0.413282
2  1.824398  0.190816 -0.413282
3  1.416881  0.190816 -0.413282
4  1.800326  1.338266 -1.469026
5 -0.387412 -1.072996 -1.583961
6 -1.606118  0.307178  1.813142

In [46]:
df=pd.DataFrame(np.random.randint(1,10,(4,4)),columns=["a","b","c","d"])
df

   a  b  c  d
0  3  5  5  2
1  3  5  4  7
2  2  5  5  7
3  7  4  7  6

In [47]:
df.iloc[:2,2:]=NA

In [49]:
df

   a  b    c    d
0  3  5  NaN  NaN
1  3  5  NaN  NaN
2  2  5  5.0  7.0
3  7  4  7.0  6.0

In [60]:
df.fillna(df.mean(),inplace=True)

In [61]:
df

   a  b    c    d
0  3  5  6.0  6.5
1  3  5  6.0  6.5
2  2  5  5.0  7.0
3  7  4  7.0  6.0

In [83]:
# Remove duplicates
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
        'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [70]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7     True
dtype: bool

In [84]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [82]:
data['v1']=range(7)
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [86]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
        'Pastrami', 'corned beef', 'Bacon',
        'pastrami', 'honey ham', 'nova lox'],
        'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [88]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [89]:
lowercased=data['food'].str.lower()

In [90]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [92]:
data['animal']=lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [93]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [95]:
# replacing values
data=pd.Series(np.random.randint(1,10,5))

In [96]:
data

0    3
1    7
2    9
3    4
4    7
dtype: int32

In [98]:
data.replace(3,NA)

0    NaN
1    7.0
2    9.0
3    4.0
4    7.0
dtype: float64

In [101]:
data.repeat(2)

0    3
0    3
1    7
1    7
2    9
2    9
3    4
3    4
4    7
4    7
dtype: int32

In [103]:
data.replace([3,7],NA)

0    NaN
1    NaN
2    9.0
3    4.0
4    NaN
dtype: float64

In [104]:
data.replace([3,7],[NA,0])

0    NaN
1    0.0
2    9.0
3    4.0
4    0.0
dtype: float64

In [105]:
data.replace({3:'Three',7:'seven'})

0    Three
1    seven
2        9
3        4
4    seven
dtype: object